[
  {
    "id": "community-data-governance",
    "title": "Community Data Governance Frameworks",
    "tags": ["qualitative", "computational"],
    "excerpt": "Developing participatory frameworks for community-driven data stewardship and collective decision-making processes.",
    "description": "This project explores how communities can take ownership of data governance decisions that affect them. We work with local organizations to design and implement participatory processes for data collection, analysis, and sharing. Our approach combines ethnographic research with the development of digital tools that support collective decision-making about data use and privacy.",
    "status": "active",
    "year": "2024-2026",
    "collaborators": ["Community Learning Center", "Local Privacy Coalition"],
    "publications": ["CHI 2025 (accepted)", "Data & Society working paper (in prep)"],
    "github": "https://github.com/datainfrastructuregroup/community-governance"
  },
  {
    "id": "pipeline-reproducibility",
    "title": "Reproducible Data Processing for Community Organizations",
    "tags": ["computational"],
    "excerpt": "Building lightweight, accessible tools for reproducible data analysis workflows in resource-constrained environments.",
    "description": "Many community organizations struggle with data processing workflows that are difficult to reproduce, update, or share. This project develops containerized, well-documented data processing pipelines that can run on modest hardware and be maintained by staff with limited technical training. We focus on common nonprofit use cases like program evaluation, grant reporting, and advocacy research.",
    "status": "active", 
    "year": "2024-2025",
    "collaborators": ["Three local nonprofits", "Regional foundation"],
    "publications": ["Undergraduate Research Symposium 2025"],
    "github": "https://github.com/datainfrastructuregroup/nonprofit-pipelines"
  },
  {
    "id": "algorithmic-audit-history",
    "title": "Historical Analysis of Algorithmic Auditing Practices",
    "tags": ["qualitative"],
    "excerpt": "Tracing the evolution of algorithmic accountability practices and their relationship to broader social justice movements.",
    "description": "This archival research project examines how algorithmic auditing practices have evolved over the past two decades, with particular attention to the role of community organizing and advocacy in shaping accountability mechanisms. We analyze policy documents, court cases, advocacy campaigns, and academic literature to understand how different stakeholders have defined algorithmic harm and proposed remedies.",
    "status": "active",
    "year": "2025-2026", 
    "collaborators": ["Digital rights organizations", "Legal scholars"],
    "publications": ["Conference proposal in preparation"],
    "github": null
  }
]
